jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
/*  ____  ____      _    __  __  ____ ___
 * |  _ \|  _ \    / \  |  \/  |/ ___/ _ \
 * | | | | |_) |  / _ \ | |\/| | |  | | | |
 * | |_| |  _ <  / ___ \| |  | | |__| |_| |
 * |____/|_| \_\/_/   \_\_|  |_|\____\___/
 *                           research group
 *                             dramco.be/
 *
 *  KU Leuven - Technology Campus Gent,
 *  Gebroeders De Smetstraat 1,
 *  B-9000 Gent, Belgium
 *
 *         File: usr_ble.c
 *      Created: 2022-03-01
 *       Author: Jona Cappelle
 *      Version: 1.0
 *
 *  Description: Bluetooth Low Energy (BLE) communication (MASTER)
 *
 *  Commissiond by Interreg NOMADe
 *
 */


#define USE_INTERNAL_COMM

// Header file
#include "usr_ble.h"

// Common
#include "nordic_common.h"

// Logging

#define NRF_LOG_MODULE_NAME usr_ble_c
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

// #include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

// Bluetooth services
#include "ble_bas_c.h"          // Battery service
#include "ble_imu_service_c.h"  // IMU service

// List of connected slaves
#include "sdk_mapped_flags.h"


// Error handler
#include "app_error.h"

// Scheduler
#include "app_scheduler.h"

// Utilities
#include "usr_util.h"

// Time syncronization
#include "usr_time_sync.h"

// Communication between nRF52 and STM32
#include "usr_internal_comm.h"

///////////////////////////////////////////////

#include "app_uart.h"
#include "ble_db_discovery.h"
#include "app_timer.h"
#include "app_util.h"
#include "bsp_btn_ble.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "nrf_ble_gatt.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_ble_scan.h"
#include "ble_conn_state.h"
#include "usr_uart.h"
#include "ble_advertising.h"
#include "ble.h"

/////////////
// Defines //
/////////////

BATTERY_ARRAY batt_array;

// Initialisation of IMU struct
IMU imu = {
    .frequency = 0,
    .stop = 0,
    .sync_start_time = 0,
    .received_packet_counter1 = 0,
    .received_packet_counter2 = 0,
    .received_packet_counter3 = 0,
    .received_packet_counter4 = 0,
    .evt_scheduled = 0,
    .uart_rx_evt_scheduled = 0,
    .uart = NRF_DRV_UART_INSTANCE(0),
    .wom = 0,
    .start_calibration = 0,
};

// Initialisation of struct to keep track of different buffers
BUFFER buffer;

static char const *m_target_periph_name[NRF_BLE_SCAN_NAME_CNT] = {"IMU1", "IMU2", "IMU3", "IMU4"};

static ble_gap_addr_t const address_init = {
    .addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
    .addr = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF } // { 0xF2, 0x9C, 0x43, 0xE8, 0x5C, 0xD2 }
};


#define APP_BLE_CONN_CFG_TAG 1  /**< Tag that refers to the BLE stack configuration set with @ref sd_ble_cfg_set. The default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */
#define APP_BLE_OBSERVER_PRIO 3 /**< BLE observer priority of the application. There is no need to modify this value. */

NRF_BLE_GATT_DEF(m_gatt);        /**< GATT module instance. */
BLE_DB_DISCOVERY_DEF(m_db_disc); /**< Database discovery module instance. */
NRF_BLE_SCAN_DEF(m_scan);        /**< Scanning Module instance. */
NRF_BLE_GQ_DEF(m_ble_gatt_queue, /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_CENTRAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);


// Keep track of connected device conn_handles and IDs
dcu_connected_devices_t dcu_conn_dev[NRF_SDH_BLE_CENTRAL_LINK_COUNT];



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// IMU SERVICE
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

BLE_IMU_SERVICE_C_ARRAY_DEF(m_imu_service_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT); /**< Structure used to identify the battery service. */


static void queue_process_packet(received_data_t * data, uint32_t * len)
{
    ret_code_t err_code;

    // Put the received data in FIFO buffer
    err_code = app_fifo_write(&buffer.received_data_fifo, (uint8_t *) data, len);

    // NRF_LOG_INFO("Fifo PUT: %d", usr_get_fifo_len(&buffer.received_data_fifo))

    if (err_code == NRF_ERROR_NO_MEM)
    {
        NRF_LOG_INFO("RECEIVED DATA FIFO BUFFER FULL!");
    }
    if (err_code == NRF_SUCCESS)
    {
        schedule(imu_uart_sceduled); // TODO CHECK
    }
    APP_ERROR_CHECK(err_code);
}

void print_packet_count(ble_imu_service_c_evt_t *p_evt)
{
    // Print out the packet count from each of the slaves
    if (p_evt->conn_handle == 0)
    {
        imu.received_packet_counter1++;
        NRF_LOG_INFO("received_packet_counter1 %d", imu.received_packet_counter1);
    }
    else if (p_evt->conn_handle == 1)
    {
        imu.received_packet_counter2++;
        NRF_LOG_INFO("received_packet_counter2 %d", imu.received_packet_counter2);
    }
    else if (p_evt->conn_handle == 2)
    {
        imu.received_packet_counter3++;
        NRF_LOG_INFO("received_packet_counter3 %d", imu.received_packet_counter3);
    }
    else if (p_evt->conn_handle == 3)
    {
        imu.received_packet_counter4++;
        NRF_LOG_INFO("received_packet_counter4 %d", imu.received_packet_counter4);
    }
}


void imu_service_c_evt_handler(ble_imu_service_c_t *p_ble_imu_service_c, ble_imu_service_c_evt_t *p_evt)
{
    // Print packet count for each connected device
    // print_packet_count(p_evt);

    // NRF_LOG_INFO("imu_service_c_evt_handler: %d", p_evt->evt_type);

    switch (p_evt->evt_type)
    {
        ret_code_t err_code;

    case BLE_IMU_SERVICE_C_EVT_DISCOVERY_COMPLETE:
    {

        // NRF_LOG_INFO("imu_service_c_evt_handler: conn_handle: %d", p_evt->conn_handle);

        // Assign connection handles
        // usr_ble_handles_assign(p_ble_imu_service_c, p_evt);

        ret_code_t err_code;

        err_code = ble_imu_service_c_handles_assign(p_ble_imu_service_c,
                                        p_evt->conn_handle,
                                        &p_evt->params.peer_db);
        APP_ERROR_CHECK(err_code);

        // NRF_LOG_INFO("IMU assigned conn_handle: %d - %d, %d", p_ble_imu_service_c->conn_handle, m_imu_service_c[0].conn_handle, m_imu_service_c[1].conn_handle);

        // Enable notifications - in peripheral this equates to turning on the sensors
        usr_enable_notif(p_ble_imu_service_c, p_evt);
        NRF_LOG_FLUSH();

        // Added in an attempt to improve faster commissioning
        // Send connection dev list once a device has connected
        dcu_connected_devices_t dev[NRF_SDH_BLE_CENTRAL_LINK_COUNT];
        get_connected_devices(dev, sizeof(dev));
        // uart_send_conn_dev(dev, sizeof(dev));

