jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
        // Get MAC address of connection handle
        ble_gap_addr_t address;
        for(uint8_t i=0; i<NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
        {
            if(dev[i].conn_handle == p_evt->conn_handle)
            {
                address = dev[i].addr;
            }
        }
        uart_send_conn_dev_update(&address, sizeof(address), COMM_CMD_CONN_DEV_UPDATE_CONNECTED);
        NRF_LOG_INFO("BLE_IMU_SERVICE_C_EVT_DISCOVERY_COMPLETE for %X %X %X %X %X %X: TX send", address.addr[0], address.addr[1], address.addr[2], address.addr[3], address.addr[4], address.addr[5]);
        
        /* ADDED CHANGES*/
        if (ble_conn_state_central_conn_count() < NRF_SDH_BLE_CENTRAL_LINK_COUNT)
        {

            NRF_LOG_INFO("%d of %d modules connected -> Resume scanning", ble_conn_state_central_conn_count(), NRF_SDH_BLE_CENTRAL_LINK_COUNT);
            // Resume scanning.
            scan_start();
        }else{
            NRF_LOG_INFO("%d of %d modules connected -> Stop scanning", ble_conn_state_central_conn_count(), NRF_SDH_BLE_CENTRAL_LINK_COUNT);
        }
        /* END ADDED CHANGES */
    }
    break;

    case BLE_IMU_SERVICE_EVT_INFO:
    {

        NRF_LOG_INFO("Event INFO: start %d - done %d - gyr %d - accel %d - mag %d - sync complete %d", 
            p_evt->params.value.info_data.calibration_start,
            p_evt->params.value.info_data.calibration_done,
            p_evt->params.value.info_data.gyro_calibration_done,
            p_evt->params.value.info_data.accel_calibration_drone,
            p_evt->params.value.info_data.mag_calibration_done,
            p_evt->params.value.info_data.sync_complete);
        NRF_LOG_FLUSH();

        // Process packet
        ble_imu_service_c_evt_type_t type = BLE_IMU_SERVICE_EVT_INFO;
        comm_process(type, p_evt);

    }
    break;

    case BLE_IMU_SERVICE_EVT_QUAT:
    {

        #ifdef USE_INTERNAL_COMM

        // Process packet
        ble_imu_service_c_evt_type_t type = BLE_IMU_SERVICE_EVT_QUAT;
        comm_process(type, p_evt);

        #else

        for (uint8_t i = 0; i < BLE_PACKET_BUFFER_COUNT; i++)
        {
            received_data_t received_quat;
            uint32_t received_quat_len = sizeof(received_quat);

            // Initialize struct to all zeros
            memset(&received_quat, 0, received_quat_len);

            received_quat.conn_handle = p_evt->conn_handle;
            received_quat.quat_data_present = 1;

            #define FIXED_POINT_FRACTIONAL_BITS_QUAT 30

            received_quat.quat_data.w = ((float)p_evt->params.value.quat_data.quat[i].w / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.x = ((float)p_evt->params.value.quat_data.quat[i].x / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.y = ((float)p_evt->params.value.quat_data.quat[i].y / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.z = ((float)p_evt->params.value.quat_data.quat[i].z / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));

            NRF_LOG_INFO("quat: %d %d  %d  %d", (int)(received_quat.quat_data.w*1000), (int)(received_quat.quat_data.x*1000), (int)(received_quat.quat_data.y*1000), (int)(received_quat.quat_data.z*1000));

            // Put data into FIFO buffer and let event handler know to process the packet
            queue_process_packet(&received_quat, &received_quat_len);
        }
        #endif

    }
    break;

    case BLE_IMU_SERVICE_EVT_EULER:
    {
        float euler_buff[3];
        uint32_t euler_buff_len = sizeof(euler_buff);

        #define FIXED_POINT_FRACTIONAL_BITS_EULER 16

        euler_buff[0] = ((float)p_evt->params.value.euler_data.yaw / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
        euler_buff[1] = ((float)p_evt->params.value.euler_data.pitch / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
        euler_buff[2] = ((float)p_evt->params.value.euler_data.roll / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));

        NRF_LOG_INFO("euler: %d %d  %d", (int)euler_buff[0], (int)euler_buff[1], (int)euler_buff[2]);
    
    }
    break;

    case BLE_IMU_SERVICE_EVT_RAW:
    {
        #ifdef USE_INTERNAL_COMM

        // Process packet
        ble_imu_service_c_evt_type_t type = BLE_IMU_SERVICE_EVT_RAW;
        comm_process(type, p_evt);

        // NRF_LOG_INFO("p_evt raw timestamp: %d", p_evt->params.value.raw_data.single_raw[0].timestamp_ms);

        #else

        for (uint8_t i = 0; i < BLE_PACKET_BUFFER_COUNT; i++)
        {

    #define RAW_Q_FORMAT_GYR_COMMA_BITS 5  // Number of bits used for comma part of raw data.
    #define RAW_Q_FORMAT_ACC_COMMA_BITS 10 // Number of bits used for comma part of raw data.
    #define RAW_Q_FORMAT_CMP_COMMA_BITS 4  // Number of bits used for comma part of raw data.

            received_data_t received_raw;
            uint32_t received_raw_len = sizeof(received_raw);

            // Initialize struct to all zeros
            memset(&received_raw, 0, received_raw_len);

            received_raw.conn_handle = p_evt->conn_handle;
            received_raw.raw_data_present = 1;
            received_raw.raw_data.gryo.x = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.x / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            received_raw.raw_data.gryo.y = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.y / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            received_raw.raw_data.gryo.z = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.z / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));

            received_raw.raw_data.accel.x = ((float)p_evt->params.value.raw_data.single_raw[i].accel.x / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            received_raw.raw_data.accel.y = ((float)p_evt->params.value.raw_data.single_raw[i].accel.y / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            received_raw.raw_data.accel.z = ((float)p_evt->params.value.raw_data.single_raw[i].accel.z / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));

            received_raw.raw_data.mag.x = ((float)p_evt->params.value.raw_data.single_raw[i].compass.x / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            received_raw.raw_data.mag.y = ((float)p_evt->params.value.raw_data.single_raw[i].compass.y / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            received_raw.raw_data.mag.z = ((float)p_evt->params.value.raw_data.single_raw[i].compass.z / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));

            // Put data into FIFO buffer and let event handler know to process the packet
            queue_process_packet(&received_raw, &received_raw_len);

            // NRF_LOG_INFO("raw:  gyro: %d %d  %d", (int)(received_raw.raw_data.gryo.x*1000), (int)(received_raw.raw_data.gryo.y*1000), (int)(received_raw.raw_data.gryo.z*1000));
            // NRF_LOG_INFO("raw:  accel: %d   %d  %d", (int)(accel[0]*1000), (int)(accel[1]*1000), (int)(accel[2]*1000));
            // NRF_LOG_INFO("raw:  mag: %d %d  %d", (int)(mag[0]*1000), (int)(mag[1]*1000), (int)(mag[2]*1000));

            // NRF_LOG_INFO("raw:  gyro: %d %d  %d", (int)(gyro[0]*1000), (int)(gyro[1]*1000), (int)(gyro[2]*1000));
            // NRF_LOG_INFO("raw:  accel: %d   %d  %d", (int)(accel[0]*1000), (int)(accel[1]*1000), (int)(accel[2]*1000));
            // NRF_LOG_INFO("raw:  mag: %d %d  %d", (int)(mag[0]*1000), (int)(mag[1]*1000), (int)(mag[2]*1000));
        }

        #endif
    }
    break;

    case BLE_IMU_SERVICE_EVT_ADC:
    {
        // NRF_LOG_INFO("ADC data: %d", p_evt->params.value.adc_data.raw[1]);

        // received_data_t received_adc;
        // uint32_t received_adc_len = sizeof(received_adc);

        // // Initialize struct to all zeros
        // memset(&received_adc, 0, received_adc_len);

        // received_adc.conn_handle = p_evt->conn_handle;
        // received_adc.adc_data_present = 1;

        // // TODO copy all data to print buffers
        // received_adc.adc_data.raw[0] = p_evt->params.value.adc_data.raw[0];

        // // Put data into FIFO buffer and let event handler know to process the packet
        // queue_process_packet(&received_adc, &received_adc_len);
    }
    break;

    default:
    {
        // NRF_LOG_INFO("imu_service_c_evt_handler DEFAULT: %d", (p_evt->evt_type));
    }
    break;
    }
}

void imu_service_c_init()
{
    ret_code_t err_code;

    ble_imu_service_c_init_t imu_service_c_init_obj;
    imu_service_c_init_obj.evt_handler = imu_service_c_evt_handler;
    imu_service_c_init_obj.p_gatt_queue = &m_ble_gatt_queue;

