jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
    // Get timestamp from master
    imu.sync_start_time = usr_ts_timestamp_get_ticks_u64();

    // Send start signal to be 2 seconds later
    imu.sync_start_time = ( USR_TIME_SYNC_TIMESTAMP_TO_USEC(imu.sync_start_time) / 1000 ) + 2000;

    imu.sync_start_time = ( USR_TIME_SYNC_MSEC_TO_TICK(imu.sync_start_time) / 100 ) * 100;


    config.sync_start_time = imu.sync_start_time;
 
    // Send config to peripheral
    usr_ble_config_send(config);

}



void schedule(app_sched_event_handler_t handler)
{
    ret_code_t err_code;

    // Signal to event handler to execute sprintf + start UART transmission
    // If there are already events in the queue
    if (imu.evt_scheduled > 0)
    {
        imu.evt_scheduled++;
    }
    // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
    else
    {
        imu.evt_scheduled++;
        err_code = app_sched_event_put(0, 0, imu_uart_sceduled);
        APP_ERROR_CHECK(err_code);
    }
}


void imu_uart_sceduled(void *p_event_data, uint16_t event_size)
{
    while (imu.evt_scheduled > 0)
    {
        ret_code_t err_code;

        bool read_success = false;

        // NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);

        char string[1024];

        received_data_t temp;
        uint32_t temp_len = sizeof(temp);

        float quat[4];
        uint32_t quat_len = sizeof(quat);

        if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)&temp, &temp_len) == NRF_SUCCESS)
        {

            // NRF_LOG_INFO("Fifo GET: %d", usr_get_fifo_len(&buffer.received_data_fifo))

            // sprintf(string, "%d w%.3fwa%.3fab%.3fbc%.3fc\n", device_nr[0], quat[0], quat[1], quat[2], quat[3]);

            // If packet contains QUATERNIONS
            if (temp.quat_data_present)
            {
                // sprintf(string, "%d Q   %.3f    %.3f    %.3f    %.3f\n", temp.conn_handle, temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
                sprintf(string, "x%dxw%.3fwa%.3fab%.3fbc%.3fc\n", temp.conn_handle, temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
            }
            else
                // if packet contains RAW DATA
                if (temp.raw_data_present)
            {
                sprintf(string, "%dx%.3fx%.3fx%.3fx%.3fx%.3fx%.3fx%.3fx%.3fx%.3f\n", temp.conn_handle, temp.raw_data.gryo.x, temp.raw_data.gryo.y, temp.raw_data.gryo.z, temp.raw_data.accel.x, temp.raw_data.accel.y, temp.raw_data.accel.z, temp.raw_data.mag.x, temp.raw_data.mag.y, temp.raw_data.mag.z);
            }
            // else
                // If packet contains ADC DATA
            //     if (temp.adc_data_present)
            // {
            //     sprintf(string, "%d ADC %.3f\n", temp.conn_handle, temp.adc_data.raw[0]);
            //     NRF_LOG_INFO("To be implemented.");
            // }

            read_success = true;
            imu.evt_scheduled--;
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {
            uint32_t string_len = calculate_string_len(string);

            // Send data over UART
            uart_queued_tx((uint8_t *)string, &string_len);
        }
    }
}














//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// BATTERY SERVICE
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// Battery serice receiver
BLE_BAS_C_ARRAY_DEF(m_bas_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT);     /**< Structure used to identify the Battery Service client module. */


/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void bas_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Battery level Collector Handler.
 */
static void bas_c_evt_handler(ble_bas_c_t * p_bas_c, ble_bas_c_evt_t * p_bas_c_evt)
{
    ret_code_t err_code;

    // NRF_LOG_INFO("bas_c_evt_handler: %d", p_bas_c_evt->evt_type);

    switch (p_bas_c_evt->evt_type)
    {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = ble_bas_c_handles_assign(p_bas_c,
                                                p_bas_c_evt->conn_handle,
                                                &p_bas_c_evt->params.bas_db);
            APP_ERROR_CHECK(err_code);

            // NRF_LOG_INFO("BAS assigned conn_handle: %d - %d, %d", p_bas_c_evt->conn_handle, m_bas_c[0].conn_handle, m_bas_c[1].conn_handle);

            // Battery service discovered. Enable notification of Battery Level.
            // NRF_LOG_DEBUG("Battery Service discovered. Reading battery level.");

            err_code = ble_bas_c_bl_read(p_bas_c);
            APP_ERROR_CHECK(err_code);

            // NRF_LOG_DEBUG("Enabling Battery Level Notification.");
            err_code = ble_bas_c_bl_notif_enable(p_bas_c);
            APP_ERROR_CHECK(err_code);

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
        case BLE_BAS_C_EVT_BATT_READ_RESP:
            // NRF_LOG_INFO("Battery Level received %d %%.", p_bas_c_evt->params.battery_level);

            // Calculate and store battery voltage level in buffer
            batt_array.batt[p_bas_c_evt->conn_handle].voltage = usr_map_adc_to_uint8(p_bas_c_evt->params.battery_level);
            NRF_LOG_INFO("Voltage (conn handle %d) -> " NRF_LOG_FLOAT_MARKER "", p_bas_c_evt->conn_handle, NRF_LOG_FLOAT(batt_array.batt[p_bas_c_evt->conn_handle].voltage));

            // Calculate and store battery percentage level in buffer
            batt_array.batt[p_bas_c_evt->conn_handle].level =  usr_adc_voltage_to_percent(batt_array.batt[p_bas_c_evt->conn_handle].voltage);
            // NRF_LOG_INFO("Percentage (conn handle %d) -> %d", p_bas_c_evt->conn_handle, batt_array.batt[p_bas_c_evt->conn_handle].level);

            break;

        default:
            break;
    }
}

void get_battery(BATTERY_ARRAY* batt, uint32_t* len)
{
    *len = sizeof(batt_array);
    memcpy(batt, &batt_array, *len);
}

/**
 * @brief Battery level collector initialization.
 */
static void bas_c_init(void)
{
    ret_code_t err_code;

