jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
    ble_bas_c_init_t bas_c_init_obj;

    bas_c_init_obj.evt_handler   = bas_c_evt_handler;
    bas_c_init_obj.error_handler = bas_error_handler;
    bas_c_init_obj.p_gatt_queue  = &m_ble_gatt_queue;


    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_bas_c_init(&m_bas_c[i], &bas_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}

void usr_batt_print_conn_handle()
{
        uart_print("------------------------------------------\n");

        ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

        for (uint32_t i = 0; i < conn_central_handles.len; i++)
        {
            uint16_t conn_handle = conn_central_handles.conn_handles[i];

            // Print Connected Devices
            uint8_t str[100];
            sprintf(str, "Battery level: (conn handle %d)   %0.2f   ( +- %d procent )\n", conn_handle, batt_array.batt[conn_handle].voltage, batt_array.batt[conn_handle].level);
            uart_print(str);
        }
        uart_print("------------------------------------------\n");  
}




//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// BLE COMMON
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t *p_evt)
{
    // Add discovery for IMU_SERVICE service
    ble_imu_service_on_db_disc_evt(&m_imu_service_c[p_evt->conn_handle], p_evt);

    // Add discovery for Battery service
    ble_bas_on_db_disc_evt(&m_bas_c[p_evt->conn_handle], p_evt);
}


bool compare_equal_ble_gap_addr_t(ble_gap_addr_t first, ble_gap_addr_t second)
{
    for(uint16_t i=0; i<BLE_GAP_ADDR_LEN; i++)
    {
       if( first.addr[i] != second.addr[i])
       {
           return false;
       }
    }
    return true;
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ret_code_t err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
    case BLE_GAP_EVT_ADV_REPORT:
        {
        // Initialize advertisement report for parsing.
        // NRF_LOG_INFO("Peer_addr %d", p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr);
        // NRF_LOG_INFO("Handle %d",p_ble_evt->evt.gap_evt.params.scan_req_report.adv_handle);

        } break;

    case BLE_GAP_EVT_CONNECTED:
    {
        // Stop scanning for a moment to allow correct configuration and recognition of services
        scan_stop();

        // NRF_LOG_INFO("Connected to %02x:%02x:%02x:%02x:%02x:%02x", p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[0],
                                                                        // p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[1],
                                                                        // p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[2],
                                                                        // p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[3],
                                                                        // p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[4],
                                                                        // p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr[5]);
        // NRF_LOG_INFO("conn_handle: %02x", p_ble_evt->evt.gap_evt.conn_handle);

        // Save connection handles and IDs
        if(p_gap_evt->conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            for(uint16_t i=0; i<NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
            {
                // Search address in table
                if(compare_equal_ble_gap_addr_t(dcu_conn_dev[i].addr, p_gap_evt->params.connected.peer_addr))
                {
                    // Map connection handle to address
                    dcu_conn_dev[i].conn_handle = p_gap_evt->conn_handle;

                    NRF_LOG_INFO("SAVED conn_handle: %d", dcu_conn_dev[i].conn_handle);

                    NRF_LOG_INFO("SAVED id: %02x:%02x:%02x:%02x:%02x:%02x",
                        dcu_conn_dev[i].addr.addr[0],
                        dcu_conn_dev[i].addr.addr[1],
                        dcu_conn_dev[i].addr.addr[2],
                        dcu_conn_dev[i].addr.addr[3],
                        dcu_conn_dev[i].addr.addr[4],
                        dcu_conn_dev[i].addr.addr[5]);
                }            
            }
        }else
        {
            err_code = NRF_ERROR_NOT_FOUND;
            APP_ERROR_CHECK(err_code);
        }

        // NRF_LOG_INFO("ble_evt_handler conn_handle: %d", p_gap_evt->conn_handle);

        // IMU_SERVICE CHANGES - add handles
        err_code = ble_imu_service_c_handles_assign(&m_imu_service_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
        APP_ERROR_CHECK(err_code);

