jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
        // BAS CHANGES - add handles
        err_code = ble_bas_c_handles_assign(&m_bas_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
        APP_ERROR_CHECK(err_code);

        // start discovery of services
        memset(&m_db_disc,0,sizeof(m_db_disc)); // According to ble_db_discovery_start() documentation the database shall be zero initialized before use: CHANGED
        err_code = ble_db_discovery_start(&m_db_disc, p_ble_evt->evt.gap_evt.conn_handle);
        APP_ERROR_CHECK(err_code);

        // Change to 2MBIT PHY
        NRF_LOG_DEBUG("PHY update!");
        ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_2MBPS,
                .tx_phys = BLE_GAP_PHY_2MBPS,
            };
        err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        APP_ERROR_CHECK(err_code);

        // Set connection LEDs
        DCU_set_connection_leds(dcu_conn_dev, CONNECTION);
    }
    break;

    case BLE_GAP_EVT_DISCONNECTED:
    {

        // Delete connection handles and IDs
        if(p_gap_evt->conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            for(uint16_t i=0; i<NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
            {
                // Search address in table
                if(dcu_conn_dev[i].conn_handle == p_gap_evt->conn_handle)
                {
                    NRF_LOG_INFO("Disconnected: equal ID found!")
                    // Map connection handle to address
                    dcu_conn_dev[i].conn_handle = BLE_CONN_HANDLE_INVALID;
                    NRF_LOG_INFO("Set connection handle to INVALID");
                }            
            }
        }else
        {
            err_code = NRF_ERROR_NOT_FOUND;
            APP_ERROR_CHECK(err_code);
        }

        
        // // Print to uart if device disconnects
        // char str2[100];
        // sprintf(str2, "Disconnected: %d\n", p_gap_evt->conn_handle);
        // // uart_print("------------------------------------------\n");
        // uart_print(str2);
        // // uart_print("------------------------------------------\n");

        NRF_LOG_INFO("Disconnected. conn_handle: 0x%x, reason: 0x%x",
                     p_gap_evt->conn_handle,
                     p_gap_evt->params.disconnected.reason);

        // Send connection dev list once a device has connected
        dcu_connected_devices_t dev[NRF_SDH_BLE_CENTRAL_LINK_COUNT];
        get_connected_devices(dev, sizeof(dev));
        // uart_send_conn_dev(dev, sizeof(dev));

        // Get MAC address of connection handle
        ble_gap_addr_t address;
        for(uint8_t i=0; i<NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
        {
            if(dev[i].conn_handle == p_gap_evt->conn_handle)
            {
                address = dev[i].addr;
            }
        }
        uart_send_conn_dev_update(&address, sizeof(address), COMM_CMD_CONN_DEV_UPDATE_DISCONNECTED);

        DCU_set_connection_leds(dcu_conn_dev, DISCONNECTION);

        // If disconnect event occurs, resume scanning since a module is not discovered
        /* ADDED CHANGES*/
        if (ble_conn_state_central_conn_count() < NRF_SDH_BLE_CENTRAL_LINK_COUNT)
        {

            NRF_LOG_INFO("%d of %d modules connected -> Resume scanning", ble_conn_state_central_conn_count(), NRF_SDH_BLE_CENTRAL_LINK_COUNT);
            // Resume scanning.
            scan_start();
        }
        /* END ADDED CHANGES */
    }
    break;

    case BLE_GAP_EVT_TIMEOUT:
        if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
        {
            NRF_LOG_INFO("Connection Request timed out.");
        }
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported.
        err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        // Accepting parameters requested by peer.
        err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                &p_gap_evt->params.conn_param_update_request.conn_params);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
        NRF_LOG_DEBUG("PHY update request.");
        ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
        err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        APP_ERROR_CHECK(err_code);
    }
    break;

    case BLE_GATTC_EVT_TIMEOUT:
        // Disconnect on GATT Client timeout event.
        NRF_LOG_DEBUG("GATT Client Timeout.");
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTS_EVT_TIMEOUT:
        // Disconnect on GATT Server timeout event.
        NRF_LOG_DEBUG("GATT Server Timeout.");
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

        // case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        //     // No system attributes have been stored.
        //     err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
        //     APP_ERROR_CHECK(err_code);
        //     break;

    default:
        break;
    }    
}

/**@brief Function to start scanning. */
void scan_start(void)
{
    ret_code_t ret;

    ret = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(ret);

    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}

void scan_stop()
{
    // ret_code_t err_code;

    nrf_ble_scan_stop();
    // APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const *p_scan_evt)
{
    ret_code_t err_code;

    switch (p_scan_evt->scan_evt_id)
    {
    case NRF_BLE_SCAN_EVT_FILTER_MATCH:

        NRF_LOG_INFO("-------------------------------");
        NRF_LOG_INFO("Filter MATCH");

