jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
}

void get_connected_devices(dcu_connected_devices_t* conn_dev, uint32_t len)
{
    // Copy data to struct
    memcpy(conn_dev, dcu_conn_dev, len);
}


void sync_enable()
{
    ret_code_t err_code;

    // Start synchronization
    err_code = ts_tx_start(TIME_SYNC_FREQ_AUTO); //TIME_SYNC_FREQ_AUTO
    // err_code = ts_tx_start(2);
    APP_ERROR_CHECK(err_code);
    // ts_gpio_trigger_enable();
    ts_imu_trigger_enable();
    NRF_LOG_INFO("Starting sync beacon transmission!\r\n");

    set_config_sync_enable(1);
}

void sync_disable()
{
    ret_code_t err_code;

    // Stop synchronization
    err_code = ts_tx_stop();
    ts_imu_trigger_disable();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Stopping sync beacon transmission!\r\n");

    set_config_sync_enable(0);
}




//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// OTHER
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


void received_data_buffers_init()
{
    ret_code_t err_code;

    // // Initialize FIFO structure for collecting received data
    err_code = app_fifo_init(&buffer.received_data_fifo, buffer.received_data_buffer, (uint16_t)sizeof(buffer.received_data_buffer));
    APP_ERROR_CHECK(err_code);
}

uint32_t usr_ble_get_conn_handle_len()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    return conn_central_handles.len;
}

void usr_ble_print_connection_handles()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    //You can iterate through the list of connection handles:
    for (uint32_t i = 0; i < conn_central_handles.len; i++)
    {
        uint16_t conn_handle = conn_central_handles.conn_handles[i];

        // Print Connected Devices
        uint8_t str[100];
        sprintf(str, "Sensor    %d  --> conn handle  %d\n", (i + 1), conn_handle);
        uart_print(str);
    }
}

void usr_ble_print_settings()
{
    uart_print("------------------------------------------\n");
    uart_print("Current settings:\n");
    if (imu.gyro_enabled)
        uart_print("---    Gyroscope enabled\n");
    if (imu.accel_enabled)
        uart_print("---   Accelerometer enabled\n");
    if (imu.mag_enabled)
        uart_print("--- Magnetometer enabled\n");
    if (imu.euler_enabled)
        uart_print("---   Euler angles enabled\n");
    if (imu.quat6_enabled)
        uart_print("---   Quaternions 6 DoF enabled\n");
    if (imu.quat9_enabled)
        uart_print("---   Quaternions 9 DoF enabled\n");
    if (imu.frequency != 0)
    {
        uart_print("---  Sensor frequency:  ");
        char str[5];
        sprintf(str, "%d Hz\n", imu.frequency);
        NRF_LOG_INFO("string: %s", str);
        uart_print(str);
    }
    if (imu.adc)
        uart_print("---   ADC enabled\n");
    if (imu.sync_enabled)
        uart_print("---   Synchonization enabled\n");
    if (imu.wom)
        uart_print("---   WoM enabled\n");

    if (imu.start_calibration)
        uart_print("---   Start calibration enabled\n");
    uart_print("------------------------------------------\n");
}
